/**
  ******************************************************************************
  * @file    key_user.c
  * @author  周鹏程
  * @date    30-August-2019
  * @brief   该文件提供功能模块层管理功能，以管理KEY输入自定义处理的以下功能：
  *           + 初始化函数
  *           + KEY按键处理任务函数
  *
  *
  ******************************************************************************
  * @attention
  *
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "key_user.h"

/** @addtogroup FunctionalModuleLayer
  * @brief      功能模块层
  * @{
  */

/** @addtogroup FML_KEY
  * @brief      KEY输入模块
  * @{
  */

/** @addtogroup KEY_User
  * @brief      KEY输入的自定义处理
  * @{
  */

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Private function ----------------------------------------------------------*/

/** @defgroup KEY_User_Private_Functions
  * @{
  */

/** @defgroup KEY输入驱动信息管理组1 KEY输入的初始化
 *  @brief    KEY输入的初始化
 *
 @verbatim
 ===============================================================================
                 ##### KEY输入的初始化 #####
 ===============================================================================

 @endverbatim
  * @{
  */

/**
  * @brief      KEY输入功能初始化函数.
  * @param      None.
  * @retval     None.
  */
void KEY_UserInit(void)
{
    KEY_Initialize();           /* 底层驱动初始化 */
    KEY_ConfigInfoInit();       /* 按键配置信息初始化 */
}

/**
  * @}
  */

/** @defgroup KEY输入驱动信息管理组2 KEY按键处理任务函数
 *  @brief    KEY按键处理任务函数
 *
 @verbatim
 ===============================================================================
                         ##### KEY按键处理任务函数 #####
 ===============================================================================

 @endverbatim
  * @{
  */

/**
  * @brief      KEY输入扫描任务.
  * @note       10ms任务
  * @param      None.
  * @retval     None.
  */
void KEY_ScanTask(void)
{
    KEY_AllButtonInScan();      /* 底层驱动信号输入 */
    KEY_ConfigInfoHandle();     /* 按键配置信息处理 */
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

